import re
from acora import AcoraBuilder

Zhejiang = ['浙江','杭州', '宁波', '温州', '嘉兴', '湖州', '绍兴', '金华', '衢州', '台州', '丽水', '舟山',
            '上城', '下城', '西湖', '拱墅', '江干', '滨江', '余杭', '萧山',
            '富阳', '建德', '临安', '淳安', '桐庐',
            '海曙', '江东', '江北', '北仑', '鄞州', '镇海',
            '慈溪', '余姚', '奉化', '宁海', '象山',
            '辖鹿城','瓯海', '龙湾', '乐清', '瑞安', '洞头', '永嘉', '平阳', '苍南', '文成', '泰顺',
            '朱家角', '遂昌', '开化', '昆山', '泰州', '福州', '上海', '横店', '乌镇',
            '四川', '南浔']

jingdian = ['千岛湖', '解放路', '西湖', '西塘', '灵隐寺', '雷峰塔', '同里古镇', '景点', '九堡客运', '海洋世界',
            '宋城', '溪口', '尖峰山', '双龙洞', '杜鹃花', '南尖岩', '油菜花', '云和梯田', '白沙岛',
            '周庄', '普陀山', '三潭印月', '钱塘江', '阿育王寺', '古镇', '鲁迅', '乌将军庙',
            '西栅', '东栅', '桃花岛', '海宁', '西溪湿地', '沈家门渔港', '月湖', '双龙', '东极岛',
            '金沙滩', '雁荡山', '莫干山', '飞来峰', '龙井茶']

Route = ['路线', '路线行程', '攻略', '安排','行程', '打车', '叫车', '出租车', '门票', '酒店', '车站', '携程', '季节',
        '小吃', '美食', '酒吧', '高铁',
        '客栈', '民宿', '大学', '自驾', '滑雪', '住宿', '机场', '萧山机场', '关门', '开门', '费用',
        '帐篷', '联票', '免费', '好吃', '餐厅', '购物', '特产', '酒店', '老头儿油爆虾',
        '茅老太臭豆腐', '西餐', '五一', '十一', '玩', '时节', '时间']

data = ['1日', '2日', '3日', '4日', '5日', '6日', '7日', '8日', '9日', '10日',
        '1天', '2天', '3天', '4天', '5天', '6天', '7天', '8天', '9天', '10天',
        '一天', '两天', '三天', '四天', '五天', '六天', '七天', '八天', '九天', '十天',
        '一日', '两日', '三日', '四日', '五日', '六日', '七日', '八日', '九日', '十日']

builder = AcoraBuilder(Zhejiang)
builder.update(jingdian)
builder.update(Route)
builder.update(data)

ac = builder.build()

Synonym = {
    '路线': '行程',
    '路线行程': '行程',
    '攻略': '行程',
    '安排': '行程',

    '打车': '打车',
    '叫车': '打车',
    '出租车': '打车',

    '住宿': '酒店',
    '客栈': '酒店',
    '民宿': '酒店',

    '小吃': '美食',
    '好吃': '美食',

    '十一': '国庆',

    '1日': '1天',
    '一日': '1天',
    '一天': '1天',

    '2日': '2天',
    '两日': '2天',
    '两天': '2天',

    '3日': '3天',
    '三日': '3天',
    '三天': '3天',

    '4日': '4天',
    '四日': '4天',
    '四天': '4天'
}

def get_tag(text):
    tags = []
    for kw, pos in ac.finditer(text):
        if kw in Synonym:
            tags.append(Synonym[kw])
        else:
            tags.append(kw)

    # for item in Zhejiang:
    #     if re.search(item, text): 
    #         return item;
    return tags